/*
 * Copyright (c) 2014 koiroha.org.
 * All sources and related resources are available under Apache License 2.0.
 * http://www.apache.org/licenses/LICENSE-2.0.html
*/
package org.asterisque;

import org.asterisque.msg.Message;

import javax.net.ssl.SSLSession;
import java.net.SocketAddress;
import java.util.Optional;

// ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
// Wire
// ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
/**
 * メッセージの伝達ラインを表すインターフェースです。TCP 接続における非同期 Socket に相当し、Wire のクローズは
 * TCP 接続のクローズを意味します。{@link org.asterisque.Session} に対して再接続が行われる場合、新しい Wire
 * のインスタンスが生成されます。
 *
 * メッセージのキュー/バッファリング、back pressure 等のフロー制御、再接続の処理は上位層で行われます。
 *
 * @author Takami Torao
 */
public interface Wire extends AutoCloseable {

	// ==============================================================================================
	// ローカルノードの参照
	// ==============================================================================================
	/**
	 * この Wire の {@link Node} を参照します。
	 */
	public Node node();

	// ==============================================================================================
	// ローカルノードの参照
	// ==============================================================================================
	/**
	 * この Wire のローカル側アドレスを参照します。
	 */
	public SocketAddress local();

	// ==============================================================================================
	// リモートノードの参照
	// ==============================================================================================
	/**
	 * この Wire のリモート側アドレスを参照します。
	 */
	public SocketAddress remote();

	// ==============================================================================================
	// サーバ側判定
	// ==============================================================================================
	/**
	 * こちら側の端点が接続を受け付けた場合に true を返します。
	 * プロトコル上どちらが master でどちらが worker かの役割を決める必要がある場合に使用することができます。
	 */
	public boolean isServer();

	// ==============================================================================================
	// イベントハンドラの設定
	// ==============================================================================================
	/**
	 * この Wire のイベントハンドラを設定します。
	 */
	public void setPlug(Optional<Plug> plug);

	// ==============================================================================================
	// 出力可能設定
	// ==============================================================================================
	/**
	 * スタブの {@link org.asterisque.Wire.Plug#produce()} に送信可能なメッセージが到着した、またはなくなった
	 * 間で状態が変化した時に呼び出されます。サブクラスはこのメソッドをオーバーライドして下層の通信実装から
	 * {@link java.nio.channels.SelectionKey#OP_WRITE} のような出力可能の通知設定を制御することが出来ます。
	 *
	 * サブクラスはデフォルトで writable = false の状態を持つ必要があります。
	 * スタブが設定されていない状態で writable を true に設定することは出来ません。
	 *
	 * @param writable スタブに送信可能なメッセージが発生した場合 true
	 */
	public void setWritable(boolean writable);

	// ==============================================================================================
	// 入力可能設定
	// ==============================================================================================
	/**
	 * スタブの {@link org.asterisque.Wire.Plug#consume(org.asterisque.msg.Message)} が管理するキューが
	 * 新しいメッセージを受けられるようになった/ならないで状態が切り替わったときに呼び出されます。
	 *
	 * サブクラスはデフォルトで readable = false の状態を持つ必要があります。
	 *
	 * @param readable スタブがメッセージを受け取れるようになったとき true
	 */
	public void setReadable(boolean readable);

	// ==============================================================================================
	// ピア証明書の参照
	// ==============================================================================================
	/**
	 * この Wire の通信相手の証明書セッションを参照します。ピアとの通信に認証が使用されていなければ Optional.empty()
	 * を返します。
	 * @return この通信の SSL セッション
	 */
	public Optional<SSLSession> getSSLSession();

	// ==============================================================================================
	// クローズ
	// ==============================================================================================
	/**
	 * この Wire をクローズしリソースを解放します。
	 */
	public void close();

	// ==============================================================================================
	// インスタンスの文字列化
	// ==============================================================================================
	/**
	 * この Wire の接続先情報を人が読む目的の文字列として参照します。
	 * @return この Wire の接続情報
	 */
	public String toString();

	// ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
	// Plug
	// ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
	/**
	 * Wire が使用するスタブです。
	 */
	public interface Plug {
		/**
		 * Wire が書き込み可能になった時に次の送信メッセージを参照するための処理。送信可能なメッセージが存在するか
		 * は {@link #setWritable(boolean)} で制御されるため送信可能なメッセージが存在しない状態で呼び出される事は
		 * ありません。
		 */
		public Message produce();
		/**
		 * Wire が読み込んだメッセージを渡す処理。{@link #setReadable(boolean)} で抑止可能だが false に設定した
		 * 時点で既にメッセージを読み込んでいた場合は呼び出される事がある。
		 */
		public void consume(Message msg);
		/**
		 * この Wire がクローズされたときに呼び出す処理。明示的に {@link #close()} を呼び出した場合と、下層の通信
		 * 実装が切断された場合に呼び出されます。
		 */
		public void onClose(Wire wire);
		/** ログ出力で識別するための文字列。 */
		public String id();
	}

}
