/*
 * Copyright (c) 2014 koiroha.org.
 * All sources and related resources are available under Apache License 2.0.
 * http://www.apache.org/licenses/LICENSE-2.0.html
*/
package org.asterisque.message;

import org.asterisque.Debug;

// ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
// Control
// ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
/**
 * Control メッセージはフレームワークによって他のメッセージより優先して送信されます。
 *
 * @author Takami Torao
 */
public final class Control extends Message {

	public static final byte StreamHeader = 'Q';

	public static final byte Close = 1;

	// ==============================================================================================
	// ID
	// ==============================================================================================
	/**
	 * 制御コードです。
	 * 最上位ビットが 1 の場合に Struct を持ちます。
	 */
	public final byte code;

	// ==============================================================================================
	// データ
	// ==============================================================================================
	/**
	 * コード値に付属するデータを表すバイナリです。
	 */
	public final byte[] data;

	// ==============================================================================================
	// コンストラクタ
	// ==============================================================================================
	/**
	 * Control メッセージを構築します。
	 */
	public Control(byte code, byte[] data){
		super((short)0 /* not used */);
		if(data == null){
			throw new NullPointerException("data is null");
		}
		this.code = code;
		this.data = data;
	}

	// ==============================================================================================
	// コンストラクタ
	// ==============================================================================================
	/**
	 * Control メッセージを構築します。
	 */
	public Control(byte code){
		super((short)0 /* not used */);
		this.code = code;
		this.data = new byte[0];
	}

	// ==============================================================================================
	// インスタンスの文字列化
	// ==============================================================================================
	/**
	 * このインスタンスを文字列化します。
	 */
	@Override
	public String toString(){
		return "Control(0x" + String.format("%02X", code & 0xFF) + "," + Debug.toString(data) + ")";
	}

}
